from utils import important_message

def main():
    # Запрашиваем текст сообщения у пользователя
    user_input = input("текст сообщения: ")
    
    # Выводим сообщение с помощью функции important_message
    print(important_message(user_input))

if __name__ == "__main__":
    main()

# Пример ручного теста:
# >>> main()
# текст сообщения: ЗАГОЛОВОК ПРОГРАММЫ

# #=============================================================================#
# #                                                                             #
# #                             ЗАГОЛОВОК ПРОГРАММЫ                             #
# #                                                                             #
# #=============================================================================#

# >>> text = 'Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы'
# >>> msg = important_message(text)
# >>> print(msg)
# #=============================================================================#
# #                                                                             #
# #  Обратите внимание на очень важное сообщение от команды разработчиков этой  #
# #                            великолепной программы                           #
# #                                                                             #
# #=============================================================================#
# >>> 