dictionary = {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5, 'f': 6, 'g': 7, 'h': 8}

a1 = input("Введите координаты первой клетки (например, a1): ")
a2 = input("Введите координаты второй клетки (например, b2): ")

letter1, number1 = a1[0], int(a1[1])
letter2, number2 = a2[0], int(a2[1])

if (dictionary[letter1] + number1) % 2 == (dictionary[letter2] + number2) % 2:
    print("да")
else:
    print("нет")

#Пример ввода 1:
#Введите координаты первой клетки (например, a1): a1
#Введите координаты второй клетки (например, b2): b2
#Пример вывода 1: да

#Пример ввода 2:
#Введите координаты первой клетки (например, a1): a1
#Введите координаты второй клетки (например, b2): b1
#Пример вывода 2: нет                                               